; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image4 - mode
	image3 - mode
	image2 - mode
	infrared1 - mode
	image6 - mode
	infrared5 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared5)
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image2)
	(supports instrument1 infrared1)
	(supports instrument1 image3)
	(supports instrument1 thermograph0)
	(supports instrument1 image6)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(pointing satellite0 Star9)
	(have_image Phenomenon5 image2)
	(have_image Planet6 thermograph0)
	(have_image Planet7 infrared1)
	(have_image Star8 image4)
	(have_image Star8 image3)
	(have_image Star9 image6)
	(have_image Phenomenon10 thermograph0)
	(have_image Planet11 image2)
	(have_image Star12 thermograph0)
	(have_image Planet13 infrared5)
	(have_image Star14 image2)
	(have_image Planet15 image6)
))

)

; plan
1. (turn_to satellite0 groundstation1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 13
4. (turn_to satellite0 star8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star8)
   goals met: 0 of 13
5. (take_image satellite0 star8 instrument0 image4)
   added: (have_image star8 image4)
   goals met: 1 of 13
6. (take_image satellite0 star8 instrument0 image3)
   added: (have_image star8 image3)
   goals met: 2 of 13
7. (turn_to satellite0 planet13 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet13)
   goals met: 2 of 13
8. (take_image satellite0 planet13 instrument0 infrared5)
   added: (have_image planet13 infrared5)
   goals met: 3 of 13
9. (turn_to satellite0 star3 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star3)
   goals met: 3 of 13
10. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 13
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 13
12. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 3 of 13
13. (turn_to satellite0 planet11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet11)
   goals met: 3 of 13
14. (take_image satellite0 planet11 instrument1 image2)
   added: (have_image planet11 image2)
   goals met: 4 of 13
15. (turn_to satellite0 phenomenon5 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 13
16. (take_image satellite0 phenomenon5 instrument1 image2)
   added: (have_image phenomenon5 image2)
   goals met: 5 of 13
17. (turn_to satellite0 phenomenon10 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 13
18. (take_image satellite0 phenomenon10 instrument1 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 6 of 13
19. (turn_to satellite0 planet15 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet15)
   goals met: 6 of 13
20. (take_image satellite0 planet15 instrument1 image6)
   added: (have_image planet15 image6)
   goals met: 7 of 13
21. (turn_to satellite0 planet6 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet6)
   goals met: 7 of 13
22. (take_image satellite0 planet6 instrument1 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 8 of 13
23. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 8 of 13
24. (take_image satellite0 planet7 instrument1 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 9 of 13
25. (turn_to satellite0 star12 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star12)
   goals met: 9 of 13
26. (take_image satellite0 star12 instrument1 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 10 of 13
27. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 10 of 13
28. (take_image satellite0 star14 instrument1 image2)
   added: (have_image star14 image2)
   goals met: 11 of 13
29. (turn_to satellite0 star9 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star9)
   goals met: 12 of 13
30. (take_image satellite0 star9 instrument1 image6)
   added: (have_image star9 image6)
   goals met: 13 of 13
